In [13]:
import matplotlib.pyplot as plt
from matplotlib import style
import numpy as np
import pandas as pd
import pandas_datareader.data as wb
import datetime as dt
from pandas import Series, DataFrame

style.use('ggplot')
%matplotlib inline

In [14]:
start = dt.datetime(1990, 1, 1)
end = dt.datetime(2018, 5, 30)
ibm_raw = wb.DataReader("IBM", 'morningstar', start, end)

In [15]:
display(ibm_raw.head())
display(ibm_raw.tail())

                     Close     High      Low     Open   Volume
Symbol Date
IBM    1990-01-01  23.5313  23.6563  23.5000  23.5625        0
       1990-01-02  24.5000  24.5313  23.6250  23.6875  7041600
       1990-01-03  24.7188  24.8750  24.5938  24.6875  9464000
       1990-01-04  25.0000  25.0938  24.7188  24.7500  9674800
       1990-01-05  24.9375  25.4063  24.8750  24.9675  7570000

                    Close    High     Low    Open   Volume
Symbol Date
IBM    2018-05-24  144.07  144.48  142.95  144.39  3389139
       2018-05-25  143.64  144.57  143.46  143.90  4914294
       2018-05-28  143.64  143.64  143.64  143.64        0
       2018-05-29  141.22  142.89  140.21  142.53  4537638
       2018-05-30  142.62  143.10  141.82  141.90  5077049

In [16]:
ibm_raw.reset_index(inplace=True)
ibm_raw.set_index("Date", inplace=True)
ibm_raw = ibm_raw.drop("Symbol", axis=1)

display(ibm_raw.head())
display(ibm_raw.tail())

              Close     High      Low     Open   Volume
Date
1990-01-01  23.5313  23.6563  23.5000  23.5625        0
1990-01-02  24.5000  24.5313  23.6250  23.6875  7041600
1990-01-03  24.7188  24.8750  24.5938  24.6875  9464000
1990-01-04  25.0000  25.0938  24.7188  24.7500  9674800
1990-01-05  24.9375  25.4063  24.8750  24.9675  7570000

             Close    High     Low    Open   Volume
Date
2018-05-24  144.07  144.48  142.95  144.39  3389139
2018-05-25  143.64  144.57  143.46  143.90  4914294
2018-05-28  143.64  143.64  143.64  143.64        0
2018-05-29  141.22  142.89  140.21  142.53  4537638
2018-05-30  142.62  143.10  141.82  141.90  5077049